"use client"
import OtherCourses from "@/app/homepage/other-courses"
import Popup from "@/components/general/popup"
import Discounts from "@/components/general/discounts"
import CourseProgram from "@/components/general/program"
import Subscribe from "@/components/general/subscribe-course"

const styles = {
    main: "w-full px-[20%] flex flex-col",
    text: "space-y-4 pb-4",
    header: "text-tera-green leading-[72px] text-[62px] font-[600] py-5",
};

export default function Page(){

    const indesignInfo = [
        { label: "Плановий старт:", value: "09.02.2026" },
        { label: "Тривалість навчання:", value: "3 місяці" },
        { label: "Кількість занять:", value: "15 занять" },
    ];

    return(
        <div>
            <div className={styles.main}>
                <div className={styles.text}>
                    <p>Курс <b>InDesign</b> орієнтований на освоєння однієї із найпопулярніших програм додрукової підготовки поліграфічної продукції. 
                        <b> InDesign</b> широко застосовується для верстки і макетування від простих завдань до складних проектів у сфері поліграфії. За допомогою <b>InDesign</b> можна зверстати макети сторінок для книг, журналів, фотокниг, рекламної продукції і навіть інтернет-сторінок.</p>
                    <p>В курсі <b>InDesign</b> розглядаються як теоретичні, так і практичні аспекти верстки, підготовки продукції до друку, правила дизайну, композиція, інструменти програми <b>InDesign</b>, її функції, налаштування, ефекти, секрети майстерності, практичні поради і нюанси роботи в <b>InDesign</b>, для пошуку яких самостійно Вам довелося б переглянути не один підручник.</p>
                    <p>Також програма <b>InDesign</b> може доповнити і спростити роботу над проектами, які розроблялися в Photoshop, CorelDraw  та Illustrator, адже дозволяє швидше і простішими способами змакетувати різні графічні елементи.</p>
                    <p>Бонусом у навчанні на даному курсі є урізноманітнення програми курсу за допомогою прийомів, які здатні полегшити виконання завдань. Це: рекомендацій правильного налаштування робочого поля чи використання комбінації "гарячих клавіш", а не ручний вибір функцій у меню.</p>
                </div>
                <Popup/>
                <CourseProgram programmArray={programmArray} />
                <Subscribe title="Adobe InDesign" price="6 000" courseInfo={indesignInfo}/>
    
            </div>
            <OtherCourses/>
            <Discounts/>
        </div>
    )
}


const programmArray = [
    "Кольоровий простір документа",
    "Ознайомлення із панеллю інструментів",
    "Налаштування комбінацій клавіш",
    "Загальна інформація про шрифти. Установка і їх використання",
    "Макетування та верстка: основні поняття, термінологія",
    "Верстка багатосторінкового документа в InDesign",
    "Верстка самостійних сторінок і розворотів",
    "Поля та колонки. Спеціальні поля: випуск за обріз",
    "Верстка самостійних сторінок і розворотів",
    "Сторінки-шаблони, їх створення, перейменування та редагування",
    "Створення текстових блоків з колонками (окремі колонки, автоматичні колонки)",
    "Робота з фреймами",
    "Налаштування текстових блоків, розташування їх на макеті",
    "Витіснення тексту графікою. Параметри обтікання",
    "Використання декількох текстових блоків у одній публікації (заголовок,підзаголовок, врізка)",
    "Кернінг, інерліньяж і трекінг",
    "Комбінації клавіш для роботи з текстом",
    "Векторні та растрові зображення",
    "Обтравочні контури, альфа-канали",
    "Криві Безьє",
    "Кадрування з використанням контура або альфа-каналу графічного об’єкта",
    "Дзеркальна копія об’єкта",
    "Об’єкти імпорту",
    "Шари в InDesign",
    "Сніппети, бібліотека зразків",
    "Шари в InDesign",
    "Кольорові моделі – CMYK, Grayscale та RGB",
    "Зразки Pantone",
    "Панелі Сolor, Swatches",
    "Створення нових зразків",
    "Створення і використання градієнтів",
    "Текстові стилі. Абзац",
    "Cтилі фрейму й об’єкта. Робота з ефектами",
    "Таблиці",
    "Завершальні роботи, підготовка до друку",
]