import Discounts from "@/components/general/discounts"

export default function Page(){



    return(
        <div className="w-full flex  flex-col px-[20%] space-y-4">
            <div className="space-y-4">
                <h2 className="text-tera-green text-[52px] font-[600] ">Adobe InDesign</h2>
                <p>Курс<b>InDesign</b> орієнтований на освоєння однієї із найпопулярніших програм додрукової підготовки поліграфічної продукції.
                    <b>InDesign</b>  широко застосовується для верстки і макетування від простих завдань до складних проектів у сфері поліграфії. За допомогою <b>InDesign</b> можна зверстати макети сторінок для книг, журналів, фотокниг, рекламної продукції і навіть інтернет-сторінок.</p>
                <p>В курсі<b>InDesign</b> розглядаються як теоретичні, так і практичні аспекти верстки, підготовки продукції до друку, правила дизайну, композиція, інструменти програми <b>InDesign</b>, її функції, налаштування, ефекти, секрети майстерності, практичні поради і нюанси роботи в <b>InDesign</b>, для пошуку яких самостійно Вам довелося б переглянути не один підручник.</p>
                <p>Також програма <b>InDesign</b> може доповнити і спростити роботу над проектами, які розроблялися в PhotoShop, CorelDraw  та illustrator, адже дозволяє швидше і простішими способами змакетувати різні графічні елементи.</p>
                <p>Бонусом у навчанні на даному курсі є урізноманітнення програми курсу за допомогою прийомів, які здатні полегшити виконання завдань. Це: рекомендацій правильного налаштування робочого поля чи використання комбінації "гарячих клавіш", а не ручний вибір функцій у меню.</p>
                
            </div>
            <span className="font-[700]"><b>Програма курсу (15 занять):</b></span>
            <ul className="px-6 list-inside list-disc">
                {programmArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>

        </div>
    )
}


const programmArray = [
    "Кольоровий простір документа",
    "Ознайомлення із панеллю інструментів",
    "Налаштування комбінацій клавіш",
    "Загальна інформація про шрифти. Установка і їх використання",
    "Макетування та верстка: основні поняття, термінологія",
    "Верстка багатосторінкового документа в InDesign",
    "Верстка самостійних сторінок і розворотів",
    "Поля та колонки. Спеціальні поля: випуск за обріз",
    "Верстка самостійних сторінок і розворотів",
    "Сторінки-шаблони, їх створення, перейменування та редагування",
    "Створення текстових блоків з колонками (окремі колонки, автоматичні колонки)",
    "Робота з фреймами",
    "Налаштування текстових блоків, розташування їх на макеті",
    "Витіснення тексту графікою. Параметри обтікання",
    "Використання декількох текстових блоків у одній публікації (заголовок,підзаголовок, врізка)",
    "Кернінг, інерліньяж і трекінг",
    "Комбінації клавіш для роботи з текстом",
    "Векторні та растрові зображення",
    "Обтравочні контури, альфа-канали",
    "Криві Безьє",
    "Кадрування з використанням контура або альфа-каналу графічного об’єкта",
    "Дзеркальна копія об’єкта",
    "Об’єкти імпорту",
    "Шари в InDesign",
    "Сніппети, бібліотека зразків",
    "Шари в InDesign",
    "Кольорові моделі – CMYK, Grayscale та RGB",
    "Зразки Pantone",
    "Панелі Сolor, Swatches",
    "Створення нових зразків",
    "Створення і використання градієнтів",
    "Текстові стилі. Абзац",
    "Cтилі фрейму й об’єкта. Робота з ефектами",
    "Таблиці",
    "Завершальні роботи, підготовка до друку",
]