import Discounts from "@/components/general/discounts"
import CourseProgram from "@/components/general/program"
import Subscribe from "@/components/general/subscribe-course"

const styles = {
    main: "w-full px-[20%] flex flex-col",
    text: "space-y-4 pb-4",
    header: "text-tera-green text-[62px] font-[600] py-5",
};

export default function Page(){

    const archicadInfo = [
        { label: "Плановий старт:", value: "8.01.2026" },
        { label: "Тривалість навчання:", value: "~3 місяці" },
        { label: "Кількість занять:", value: "20 занять" },
    ];

    return(
        <div className={styles.main}>
            <div className={styles.text}>
                <h2 className={styles.header}>Проєктування в ArchiCad</h2>
                <p><b>ArchiCad</b> - це програма для автоматизованого процесу розробки моделей будівельних споруд. Дана програма дає можливість проектантові детально розробити архітектурно-будівельні конструкції і документацію до неї.</p>
                <p>Набір інструментів та функцій даної програми роблять її незамінною для роботи архітекторів та проектантів, оскільки передбачає можливість візуалізації у тривимірному вигляді розроблюваного проекту у будь-який момент роботи.</p>
                <p>Важливе значення програма має при підготовці розрахунків, оскільки при завантаженні відповідної вихідної інформації в систему ArchiCad, програма видає характеристику і розрахунки кошторисного плану.</p>
                <p>Кваліфіковані викладачі-практики зможуть швидко і ефективно навчити основам проєктування в програмі ArchiCad. Їхній багаторічний досвід допоможе слухачам освоїти основні прийоми, що значно полегшують роботу у програмі і уникати найтиповіших помилок, що могли б виникнути при самостійному вивченні програми.</p>

            </div>
            <CourseProgram programmArray={programmArray} />
            <Subscribe title="ArchiCad" price="9 000" courseInfo={archicadInfo}/>

        </div>
    )
}


const programmArray = [
    "Концепція програми ArchiCAD",
    "Керування проектом (навігатор, плаваючі панелі і лінійки, шари)",
    "Основні методи роботи в ArchiCAD",
    "Базові методи креслення",
    "Робота з інструментами, їх налаштування",
    "Методи редагування",
    "Створення і редагування сходів",
    "Встановлення розмірів і їх редагування",
    "Побудова дахів і формування їх конструкції (розширення Roof Maker, Truss Maker)",
    "Розміщення рисунків. 3D-сітка",
    "Налаштування моделі в 3D-вікні",
    "Фотозображення",
    "Фільмування проекту",
    "Перерізи і фасади. Формування деталей і робочих аркушів",
    "Макетування конструкторської документації. Створення бібліотечних елементів",
    ]

// ДОДАТИ ТАБЛИЧКУ!!!!!!