import Discounts from "@/components/general/discounts"

export default function Page(){



    return(
        <div className="w-full flex  flex-col px-[20%] space-y-4">
            <div className="space-y-4">
            <h2 className="text-tera-green text-[52px] font-[600] ">AUTOCAD</h2>
            <p>Інтегрований графічний пакет програм AutoCAD є найбільш популярним на ринку програм автоматизованого проектування. AutoCAD є промисловим стандартом для випуску графічної частини конструкторської документації різноманітного призначення.</p>
            <p>Навчаючись на цьому курсі, слухачі отримають знання про можливості системи AutoCAD, ефективні способи і прийоми побудови двовимірної моделі реального об’єкта і створення на її основі креслення.</p>
          
            </div>
            <span className="font-[700]">Програма курсу AutoCAD (20 занять):</span>
            <ul className="px-6 list-inside list-disc">
                {programmArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>

            <span className="font-[700]">Програма курсу:</span>
            <ul className="px-6 list-inside list-disc">
                {secondProgrammArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>
            <Discounts/>
        </div>
    )
}   


const secondProgrammArray = [
    "Робота із системами координат в тривимірних моделях.",
    "Робота з рівнем і висотою..",
"Засоби перегляду тривимірних моделей.",
"Побудова тривимірних каркасних моделей.",
"Побудова тривимірних поверхонь.",
"Створення твердотілої моделі.",
"Перетин та розрізи.",
"Модифікація об’єктів в тривимірному просторі.",
"Тривимірні версії двовимірних команд редагування.",
"Вивід на друк тривимірних моделей.",
"Особливості застосування системи AutoCAD",
"Візуалізація тривимірних моделей.",

]


const programmArray = [
    "Введення в систему AutoCAD",
    "Вивчення основних властивостей креслень.",
"Графічні примітиви як основа зображення.",
"Складні графічні примітиви.",
"Редагування зображень.",
" Налаштування режимів і прийоми їх практичного викреслювання.",
"Можливості системи, які забезпечують ефективну роботу зі складними об’єктами.",
"Форматування креслення як конструкторського документа.",
"Створення та використання блоків.",
"Створення системи координат користувача і прийоми роботи з нею.",
"Оброзмірювання креслення.",
"Особливості налаштування режимів креслення і розмірних стилів.",
"Отримання твердої копії креслення.",
"Виконання випускної роботи «Розроблення креслення»",
]