"use client"
import Discounts from "@/components/general/discounts"
import CourseProgram from "@/components/general/program"
import Subscribe from "@/components/general/subscribe-course"
import OtherCourses from "@/app/homepage/other-courses"
import Popup from "@/components/general/popup"


const styles = {
    main: "w-full px-[20%] flex flex-col",
    text: "space-y-4 pb-4",
    header: "text-tera-green leading-[72px] text-[62px] font-[600] py-5",
};


export default function Page(){

    const basInfo = [
        { label: "Плановий старт:", value: "02.02.2026" },
        { label: "Тривалість навчання:", value: "~2 місяці" },
        { label: "Кількість занять:", value: "16 занять" },
        { label: "Форма навчання:", value: "індивідуальне" }
    ];

    return(
        <div>
            <div className={styles.main}>
                <div className={styles.text}>
                    <h2 className={styles.header}>Програмування в 1С (BAS)</h2>
                    <p>Оскільки сама програма для автоматизованого обліку 1С найбільш використовувана на підприємствах України і не тільки, а конфігурація цієї програми має бути налаштована із врахуванням конкретних потреб підприємства, то виникає потреба у кваліфікованому програмістові програми 1С, який би зміг адаптувати програму 1С під особливості діяльності підприємства і ведення обліку на ньому. Будучи програмістом 1С, Ви легко зможете знайти високооплачувану роботу.</p>
                    <p><b>"Тераконсалт"</b> пропонує навчання на курсі <b>"Програмування 1С"</b>, в програмі якого розглядаються механізми для вирішення практичних завдань конфігурації програми 1С різної складності. Програма курсу включає в себе вивчення базових понять, а також конкретних прикладів, котрі дозволять засвоїти основні принципи і правила у роботі над конфігурацією 1С.</p>
                    <p>Є можливість обирати версію програми 1С 7.7 або 8</p>
                </div>
                <Popup/>
                <CourseProgram programmArray={programmArray} />
                <Subscribe title="Програмування в 1С" price="8 500" courseInfo={basInfo}/>
                
            </div>
            <OtherCourses />
            <Discounts/>
        </div>
        
    )
}


const programmArray = [
    "Мова програмування",
    "Система класів платформи та конфігурації",
    "Довідники, документи, звіти, обробки, регістри накопичення",
    "Бухгалтерські підсумки",
    "SQL–запити",
    "Застосування синтакс–помічника",
    "Технологія зовнішнього з’єднання з іншими інформаційними базами 1С",
    "Складні елементи форм",
    "Вертикальні секції макетів",
    "Таблиці та списки значень"
]



/*
const programmArray = [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]
 */