import Discounts from "@/components/general/discounts"
import Popup from "@/components/general/popup"
import CourseProgram from "@/components/general/program"
import Subscribe from "@/components/general/subscribe-course"

const styles = {
    main: "w-full px-[20%] flex flex-col",
    text: "space-y-4 pb-4",
    header: "text-tera-green leading-[68px] text-[62px] font-[600] py-5",
    level_text: "text-[28px] font-[500] text-gray-800",
};

export default function Page(){

    const avk5Info = [
        { label: "Плановий старт:", value: "02.02.2026" },
        { label: "Тривалість навчання:", value: "~4 місяці" },
        { label: "Кількість занять:", value: "16 занять" },
    ];

    return(
        <div className={styles.main}>
            <div className={styles.text}>
                <h2 className={styles.header}>Кошторисна справа з використанням програмного комплексу АВК-5</h2>
                <p><b>АВК-5</b> - це програма, що найчастіше використовується для автоматичного складання кошторисів. Популярність даної програми пояснюється не лише зручністю використання її інтерфейсу, а й функціональними можливостями, що допомагають фахівцям зі складання кошторисів оптимізувати фінансові і трудові ресурси і внормувати їх у відповідності до актуальних норм законодавства.</p>
                <p><b>"Кошторисна справа з використанням програмного комплексу АВК-5"</b> - це спеціалізований курс для фахівців зі складання кошторисів, що бажають навчитись працювати з програмою АВК-5, а також для тих, хто бажає здобути спеціальність кошторисника.</p>
                <p>Курси кошторисників в Навчальному центрі "Тераконсалт" орієнтовані на вивчення методології складання кошторисних планів та супровідної документації для об'єктів різних видів та складності будівництва. Цей курс містить два рівні вивчення: базовий та поглиблений.</p>
                <Popup/>
                <p><span className={styles.level_text}><b>Базовий рівень (10 занять)</b></span><br></br>
                    Складається з двох модулів: теоретичного та практичного - вивчаються складання кошторисів та основні навички роботи з програмою АВК-5. </p>
            </div>

            <CourseProgram title={"Програма теоретичного модуля (6 занять):"} programmArray={programmArray} />
            <CourseProgram title={"Програма практичного модуля (4 заняття):"} programmArray={secondProgrammArray} />
            <p><span className={styles.level_text}><b>Поглиблений рівень. Модуль "Спеціалізація" (6 занять)</b></span><br></br>
                Має за мету навчити роботі з кошторисами складних об'єктів, оволодіти вмінням виконувати перевірку кошторисів підрядних та субпідрядних організацій, навчити професійно використовувати програму АВК-5 для складання кошторисів згідно із актуальними нормативами в Україні, тощо.</p>
            <CourseProgram title={"Програма поглибленого курсу включає:"} programmArray={thirdProgrammArray} />

            <Subscribe title="Кошторисна справа" price="9 800" courseInfo={avk5Info}/>
        </div>
    )
}


const programmArray = [
    "Основні поняття та терміни",
    "Підрахунок об'ємів будівельних робіт",
    "Створення кошторису, розрахунок відряджень та інших витрат",
    "Коефіцієнти та їх застосування",
    "Нововведення у ціноутворенні ",
    "Договірна ціна, її види та особливості",
    "Підсистема Підрядник, акти виконаних робіт КБ-2, КБ-3",
    "Дії над кошторисами",
    "Тендерна документація",
    "Особливості проходження експертизи"
]

const secondProgrammArray = [
    "5-6 прикладів складання кошторисів на різні види будівельних робіт з підрахунком об'ємів",
    "Акти КБ-2, КБ-3 з частковим виконанням",
    "Аналіз типових помилок"
]

const thirdProgrammArray = [
    "Вузькопрофільні кошториси",
    "Особливості аналізу та перевірки",
    "Індивідуальні консультації",
    "Оптимізація роботи кошторисника"
]

/*

 */

/*
const programmArray = [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]
 */