import Discounts from "@/components/general/discounts"

export default function Page(){



    return(
        <div className="w-full flex  flex-col px-[20%] space-y-4">
            <div className="space-y-4">
                <h2 className="text-tera-green text-[52px] font-[600] ">Кошторисна справа з використанням програмного комплексу АВК-5</h2>
                <p><b>АВК-5</b> - це програма, що найчастіше використовується для автоматичного складання кошторисів. Популярність даної програми пояснюється не лише зручністю використання її інтерфейсу, а й функціональними можливостями, що допомагають фахівцям зі складання кошторисів оптимізувати фінансові і трудові ресурси і внормувати їх у відповідності до актуальних норм законодавства.</p>
                <p><b>"Кошторисна справа з використанням програмного комплексу АВК-5"</b> - це спеціалізований курс для фахівців зі складання кошторисів, що бажають навчитись працювати з програмою АВК-5, а також для тих, хто бажає здобути спеціальність кошторисника.</p>
                <p>Курси кошторисників в Навчальному центрі "Тераконсалт" орієнтовані на вивчення методології складання кошторисних планів та супровідної документації для об'єктів різних видів та складності будівництва. Цей курс містить два рівні вивчення: базовий та поглиблений.</p>
                <p><b>Базовий рівень (20 занять).</b><br></br>
                    Складається з двох модулів: теоретичного та практичного - вивчаються складання кошторисів та основні навички роботи з програмою АВК-5. </p>
                
            </div>
            <span className="font-[700]">Програма теоретичного модуля (12 занять):</span>
            <ul className="px-6 list-inside list-disc">
                {programmArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>
            <span className="font-[700]">Програма практичного модуля (8 занять):</span>
            <ul className="px-6 list-inside list-disc">
                {secondProgrammArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>
            <p><b>Поглиблений рівень. Модуль "Спеціалізація". (6 занять)</b><br></br>
                Має за мету навчити роботі з кошторисами складних об'єктів, оволодіти вмінням виконувати перевірку кошторисів підрядних та субпідрядних організацій, навчити професійно використовувати програму АВК-5 для складання кошторисів згідно із актуальними нормативами в Україні, тощо.</p>
            <span className="font-[700]">Програма практичного модуля (8 занять):</span>
            <ul className="px-6 list-inside list-disc">
                {thirdProgrammArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>
        </div>
    )
}


const programmArray = [
    "Основні поняття та терміни",
    "Підрахунок об'ємів будівельних робіт",
    "Створення кошторису, розрахунок відряджень та інших витрат",
    "Коефіцієнти та їх застосування",
    "Нововведення у ціноутворенні ",
    "Договірна ціна, її види та особливості",
    "Підсистема Підрядник, акти виконаних робіт КБ-2, КБ-3",
    "Дії над кошторисами",
    "Тендерна документація",
    "Особливості проходження експертизи"
]

const secondProgrammArray = [
    "5-6 прикладів складання кошторисів на різні види будівельних робіт з підрахунком об'ємів",
    "Акти КБ-2, КБ-3 з частковим виконанням",
    "Аналіз типових помилок"
]

const thirdProgrammArray = [
    "Вузькопрофільні кошториси",
    "Особливості аналізу та перевірки",
    "Індивідуальні консультації",
    "Оптимізація роботи кошторисника"
]

/*

 */

/*
const programmArray = [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]
 */