import Discounts from "@/components/general/discounts"

export default function Page(){



    return(
        <div className="w-full flex  flex-col px-[20%] space-y-4">
            <div className="space-y-4">
                <h2 className="text-tera-green text-[52px] font-[600] ">Універсальний. ("Windows. Базовий" + "Microsoft Office")</h2>
                <p>Навчальний курс "Універсальний" допоможе освоїти базовий рівень користування ПК для повноцінної та грамотної роботи з комп'ютерною технікою.</p>
                <p>Набуті знання на курсі "Універсальний" слухачі зможуть легко застосовувати на практиці як для виконання завдань, так і як основу для вивчення більш складних програм.</p>
                <p>Навчання на курсі "Універсальний" складається з кількох блоків. Перший блок - це навчання роботі з Windows - найпопулярнішою операційною системою у світі та її стандартними програмами. В наступному блоці вивчаються програми пакету Microsoft Office: Word, Excel, PowerPoint та інше. </p>
            </div>

            <Discounts/>
        </div>
    )
}


/*
const programmArray = [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
]
 */