import Discounts from "@/components/general/discounts"

export default function Page(){



    return(
        <div className="w-full flex  flex-col px-[20%] space-y-4">
            <div className="space-y-4">
                <h2 className="text-tera-green text-[52px] font-[600] ">Програмний комплекс Ліра-САПР</h2>

                <p><b>Програма ЛІРА</b> є багатофункціональним програмним комплексом, який призначений для проектування і 
                    проведення розрахунків. Своє застосування програма отримала у сфері будівництва та машинобудування. 
                    Активно програма використовується й у проектуванні мостів.</p>
                <p>Багатий функціонал програми дозволяє підібрати і зробити перевірку елементів конструкції. Це 
                    програмне середовище дозволяє запроектувати найекономніші конструкції з найменшими затратами часу, 
                    враховуючи чинні будівельні норми.</p>
                <p>
                    Однією із найважливіших можливостей програми, що відрізняє її від інших проектно-конструкторських 
                    програм, є визначення поведінки будівель під час монтажу, її взаємодію з основою, а також дозволяє 
                    врахувати різні динамічні впливи.
                </p>
                <p>
                    Зручність використання програми полягає не лише у широких і унікальних функціях, а й у можливості 
                    інтеграції програми з іншими проектними програмами, що дозволяє залучати до роботи над проектом 
                    різні графічні програми, що мають переваги у певних аспектах робіт
                </p>
            </div>
            <span className="font-[700]">Програма курсу (5 занять):</span>
            <ul className="px-6 list-inside list-disc">
                {programmArray.map((item,index)=>(
                    <li key={index}>{item}</li>
                ))}
            </ul>
            <Discounts/>
        </div>
    )
}

const programmArray = [
    "Розрахунок плоских стрижневих систем на статичні навантаження (ферма, нерозрізна балка, плоска залізобетонна і металева рами)",
    "Розрахунок просторових рамних і рамно-в'язних систем на статичні навантаження",
    "Призначення і застосування розрахункових сполучень зусиль (РСУ), а також розрахункових сполучень навантажень (РСН)",
    "Конструювання в системі ЛІР-АРМ: розрахунок армування з подальшою видачею результатів, завдання і застосування конструктивних елементів, а також уніфікації стрижневих елементів, налагодження шкали видачі результатів армування",
    "Конструювання в системі ЛІР-СТК: видача результатів підбору та перевірки перерізів стрижневих елементів, завдання і застосування конструктивних елементів, а також уніфікації стрижневих елементів",
    "Отримання табличних та графічних результатів розрахунку",
    "Розрахунок плоских стрижневих систем на динамічні впливи (сейсмічний вплив)",
    "Аналіз результатів розрахунку ЛІР-ВІЗОР, ЛІР-СТК та ЛІР-АРМ",
]